// src/data/projects.js
import project1 from '../assets/images/project1.png';
import project2 from '../assets/images/project2.png';
import project3 from '../assets/images/project3.png';
import project4 from '../assets/images/project4.png';

export const allProjects = [
  {
    id: '1',
    title: 'Green Hills Residence',
    subtitle: 
      'Місто: Київ (передмістя, Ірпінь)\nМінімальна сума інвестиції: 50 $\nДата початку: 15 червня 2025',
    image: project1,
    details: 
      'Категорія: Культурні проєкти\n' +
      'Опис: Створення нового культурного центру у центрі Львова — простору для виставок, лекцій і концертів.\n' +
      'Навіщо потрібен: Розвиток культурного середовища та підтримка митців.\n' +
      'Ціль: Відкрити простір площею 1000 м².\n' +
      'Кінцева сума збору: 1 200 000 $\n' +
      'Тип фонду: Культура / Нерухомість',
    investedAmount: 500000,
    goalAmount: 1200000,
    investors: 120 
  },
  {
    id: '2',
    title: 'StartUA',
    subtitle: 
      'Місто: Львів\nМінімальна сума інвестиції: 10 $\nДата початку: 1 липня 2025 року',
    image: project2,
    details: 
      'Категорія: Стартапи\n' +
      'Опис: Фонд для фінансування hardware-стартапів: робототехніка, електроніка, дрони.\n' +
      'Навіщо потрібен: Розвиток нової української індустрії технологій.\n' +
      'Ціль: Інвестувати у 7 hardware-проєктів.\n' +
      'Кінцева сума збору: 3 000 000 $\n' +
      'Тип фонду: Стартапи',
    investedAmount: 2100000,
    goalAmount: 3000000,
    investors: 350
  },
  {
    id: '3',
    title: 'Green Energy Future',
    subtitle: 
      'Місто: Одеса\nМінімальна сума інвестиції: 20 $\nДата початку: 1 вересня 2025',
    image: project3,
    details: 
      'Категорія: Інновації / Енергетика\n' +
      'Опис: Створення вітрової електростанції в Одеській області.\n' +
      'Навіщо потрібен: Перехід на чисту енергію та енергетичну незалежність.\n' +
      'Ціль: Побудувати вітропарк із 5 турбінами.\n' +
      'Кінцева сума збору: 6 000 000 $\n' +
      'Тип фонду: Інновації',
    investedAmount: 4000000,
    goalAmount: 6000000,
    investors: 500
  },
  {
    id: '4',
    title: 'BioMed Invest',
    subtitle: 
      'Місто: Київ\nМінімальна сума інвестиції: 2 5 $\nДата початку: 15 вересня 2025',
    image: project4,
    details: 
      'Категорія: Біотехнології\n' +
      'Опис: Інвестування в українські стартапи в медицині та біотехнологіях.\n' +
      'Навіщо потрібен: Розвиток біомедичних технологій та лікувальних інновацій.\n' +
      'Ціль: Підтримка 5 стартапів у галузі медицини.\n' +
      'Кінцева сума збору: 5 000 000 $\n' +
      'Тип фонду: Стартапи',
    investedAmount: 4200000,
    goalAmount: 5000000,
    investors: 250
  }
];
